<?php

// Задача: Оцінки студентів
// Напиши програму, яка буде виконувати наступне:
// Створити асоціативний масив, де ключами будуть імена студентів, а значеннями - їх оцінки.
// Вивести оцінку для конкретного студента.
// Додати нову оцінку для студента.
// Вивести оновлений список студентів та їх оцінок.



$stud = [
    ["name" => "Sashko", "grade" => 9],
    ["name" => "Denchik", "grade" => 10],
    ["name" => "Haba", "grade" => 11]

];
$stud[2]["grade"] = 5;

print_r($stud);



















